from 光线追踪 import *
#场景1
v场景 = C场景()
v场景.add(C传送门组(
	C传送门(t向量3(1.99, 0, 0), PI, c传送门蓝),
	C传送门(t向量3(0, -1.01, 1.99), 半PI, c传送门橙)
))
v场景.add(C墙壁(t向量3(2, 0, 0), t向量2(4, 4), PI, t向量3(1, 0.5, 0.5), E材质.e漫反射))
v场景.add(C墙壁(t向量3(0, 0, 2), t向量2(4, 4), 半PI, t向量3(0.5, 1, 0.5), E材质.e漫反射))
v场景.add(C墙壁(t向量3(-2, 0, 0), t向量2(4, 4), 0, t向量3(0.5, 0.5, 1), E材质.e漫反射))
v场景.add(C墙壁(t向量3(0, 0, -2), t向量2(4, 4), -半PI, t向量3(1, 1, 0.5), E材质.e漫反射))
v场景.add(C地板(t向量3(0, -2, 0), t向量2(4, 4), t向量3(0.8, 0.8, 0.8), E材质.e漫反射, a天花板 = False))
v场景.add(C地板(t向量3(0, 1.99, 0), t向量2(1, 1), t向量3(10, 10, 10), E材质.e光源, a天花板 = True, a碰撞 = False))	#光
v场景.add(C地板(t向量3(0, 2, 0), t向量2(4, 4), t向量3(0.8, 0.8, 0.8), E材质.e漫反射, a天花板 = True))
v场景.add(C球体(a位置 = t向量3(0, 0, 0), a半径 = 0.3, a颜色 = t向量3(0.99, 0.99, 0.99), a材质 = E材质.e镜面反射, a速度 = t向量3(0, 0, 2)))
v场景.add(C球体(a位置 = t向量3(0, 0, -1), a半径 = 0.3, a颜色 = t向量3(0.9, 0.7, 0.3), a材质 = E材质.e模糊反射, a速度 = t向量3(0, 0, 2)))
v场景.add(C球体(a位置 = t向量3(-1, 1, 1), a半径 = 0.2, a颜色 = t向量3(0.99, 0.8, 0.8), a材质 = E材质.e折射, a速度 = t向量3(1, 0, 0)))	#红
v场景.add(C球体(a位置 = t向量3(0, 1, 1), a半径 = 0.2, a颜色 = t向量3(0.8, 0.99, 0.8), a材质 = E材质.e折射, a速度 = t向量3(1, 0, 0)))	#绿
v场景.add(C球体(a位置 = t向量3(1, 1, 1), a半径 = 0.2, a颜色 = t向量3(0.8, 0.8, 0.99), a材质 = E材质.e折射, a速度 = t向量3(1, 0, 0)))	#蓝
v场景.add(C球体(a位置 = t向量3(-1, 1, -1), a半径 = 0.2, a颜色 = t向量3(0.9, 0.9, 0.5), a材质 = E材质.e漫反射, a速度 = t向量3(1, 0, 0)))	#黄
v场景.add(C球体(a位置 = t向量3(0, 1, -1), a半径 = 0.2, a颜色 = t向量3(0.5, 0.9, 0.9), a材质 = E材质.e漫反射, a速度 = t向量3(1, 0, 0)))	#青
v场景.add(C球体(a位置 = t向量3(1, 1, -1), a半径 = 0.2, a颜色 = t向量3(0.9, 0.5, 0.9), a材质 = E材质.e漫反射, a速度 = t向量3(1, 0, 0)))	#紫
v相机 = C相机(t向量3(-3, 1, -5), t向量3(0, 0, 0), t向量3(0, 1, 0))
v投影 = C透视投影(c宽高比)
v投射 = f创建光线投射器(v相机, v投影)
v目标 = C渲染目标(*c窗口尺寸)
v物理参数 = C物理参数(a重力加速度 = 1)
v物理计算 = C物理(v场景, v物理参数)
# v染色 = C染色_物体颜色()
v染色 = C染色_光线追踪()
v渲染 = C渲染(v目标, v场景, v投射, v染色, a采样数 = 1000)
# v输出 = C窗口(v目标)
v输出 = C视频(v目标, r"E:\test\scene1", 60*60*5)
v总控 = C总控(v物理计算, v渲染, v输出)
v总控.run()